In [1]:
import pandas as pd
path="D:/Tutedude-py/Tutedude-python-code-learn/data analysis/data3.xlsx"
df=pd.read_excel(path)
print(df)

    S.No     A   B   C     D   E  length
0      1   2.0   1   5   3.0   4      45
1      2   4.0   3  10   6.0   8      43
2      3   6.0   5  15   9.0  12      66
3      4   8.0   7  20  12.0  16      78
4      5  10.0   9  25  15.0  20      32
5      6  12.0  11  30  18.0  24      12
6      7  14.0  13  35  21.0  28      54
7      8  16.0  15  40  24.0  32      67
8      9  18.0  17  45  27.0  36      77
9     10  20.0  19  50  30.0  40      89
10    11   NaN  21  55   NaN  44      45

In [2]:
import numpy as np 
grp=df.groupby("A")
grp.aggregate(np.sum)

C:\Users\Gaurav\AppData\Local\Temp\ipykernel_8032\68965597.py:3: FutureWarning: The provided callable <function sum at 0x0000023C697B4AE0> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  grp.aggregate(np.sum)

      S.No   B   C     D   E  length
A
2.0      1   1   5   3.0   4      45
4.0      2   3  10   6.0   8      43
6.0      3   5  15   9.0  12      66
8.0      4   7  20  12.0  16      78
10.0     5   9  25  15.0  20      32
12.0     6  11  30  18.0  24      12
14.0     7  13  35  21.0  28      54
16.0     8  15  40  24.0  32      67
18.0     9  17  45  27.0  36      77
20.0    10  19  50  30.0  40      89

In [3]:
grp=df.groupby(["A","B"])
grp.aggregate(np.sum)

C:\Users\Gaurav\AppData\Local\Temp\ipykernel_8032\1728981263.py:2: FutureWarning: The provided callable <function sum at 0x0000023C697B4AE0> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  grp.aggregate(np.sum)

         S.No   C     D   E  length
A    B
2.0  1      1   5   3.0   4      45
4.0  3      2  10   6.0   8      43
6.0  5      3  15   9.0  12      66
8.0  7      4  20  12.0  16      78
10.0 9      5  25  15.0  20      32
12.0 11     6  30  18.0  24      12
14.0 13     7  35  21.0  28      54
16.0 15     8  40  24.0  32      67
18.0 17     9  45  27.0  36      77
20.0 19    10  50  30.0  40      89

In [4]:
grp = df.groupby(["A","B"], as_index=False)
grp.aggregate(np.sum)

C:\Users\Gaurav\AppData\Local\Temp\ipykernel_8032\2459422481.py:2: FutureWarning: The provided callable <function sum at 0x0000023C697B4AE0> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  grp.aggregate(np.sum)

      A   B  S.No   C     D   E  length
0   2.0   1     1   5   3.0   4      45
1   4.0   3     2  10   6.0   8      43
2   6.0   5     3  15   9.0  12      66
3   8.0   7     4  20  12.0  16      78
4  10.0   9     5  25  15.0  20      32
5  12.0  11     6  30  18.0  24      12
6  14.0  13     7  35  21.0  28      54
7  16.0  15     8  40  24.0  32      67
8  18.0  17     9  45  27.0  36      77
9  20.0  19    10  50  30.0  40      89

In [6]:
grp.size()

      A   B  size
0   2.0   1     1
1   4.0   3     1
2   6.0   5     1
3   8.0   7     1
4  10.0   9     1
5  12.0  11     1
6  14.0  13     1
7  16.0  15     1
8  18.0  17     1
9  20.0  19     1

In [7]:
grp.count()

      A   B  S.No  C  D  E  length
0   2.0   1     1  1  1  1       1
1   4.0   3     1  1  1  1       1
2   6.0   5     1  1  1  1       1
3   8.0   7     1  1  1  1       1
4  10.0   9     1  1  1  1       1
5  12.0  11     1  1  1  1       1
6  14.0  13     1  1  1  1       1
7  16.0  15     1  1  1  1       1
8  18.0  17     1  1  1  1       1
9  20.0  19     1  1  1  1       1

In [9]:
l=[['apple',1],['apple',2],['apple',2],['ball',1],['ball',1]]
df_10=pd.DataFrame(l,columns=["A","B"])
print(df_10)

       A  B
0  apple  1
1  apple  2
2  apple  2
3   ball  1
4   ball  1

In [11]:
df_10.groupby("A")["B"].unique()

A
apple    [1, 2]
ball        [1]
Name: B, dtype: object

In [12]:
df_20=pd.DataFrame({'S.No' : [1,2,3,4,5,],'A': ['aaple','ant','abkle','air','arm'],'B':['ball','bat','bear','balloon','boy'],'C':['cat','cake','car','cow','coat'],'D': ['dog','duck','doll','deer','drum']})
print(df_20)

   S.No      A        B     C     D
0     1  aaple     ball   cat   dog
1     2    ant      bat  cake  duck
2     3  abkle     bear   car  doll
3     4    air  balloon   cow  deer
4     5    arm      boy  coat  drum

In [14]:
df_20.pivot(index ='A',columns='B',values='C')

B     ball balloon   bat bear   boy
A
aaple  cat     NaN   NaN  NaN   NaN
abkle  NaN     NaN   NaN  car   NaN
air    NaN     cow   NaN  NaN   NaN
ant    NaN     NaN  cake  NaN   NaN
arm    NaN     NaN   NaN  NaN  coat

In [15]:
df_20.pivot(index="S.No",columns='A')['B']

A    aaple abkle      air  ant  arm
S.No
1     ball   NaN      NaN  NaN  NaN
2      NaN   NaN      NaN  bat  NaN
3      NaN  bear      NaN  NaN  NaN
4      NaN   NaN  balloon  NaN  NaN
5      NaN   NaN      NaN  NaN  boy

In [20]:
df_20.pivot(index ='S.No',columns='A',values=['B','C'])

         B                              C
A    aaple abkle      air  ant  arm aaple abkle  air   ant   arm
S.No
1     ball   NaN      NaN  NaN  NaN   cat   NaN  NaN   NaN   NaN
2      NaN   NaN      NaN  bat  NaN   NaN   NaN  NaN  cake   NaN
3      NaN  bear      NaN  NaN  NaN   NaN   car  NaN   NaN   NaN
4      NaN   NaN  balloon  NaN  NaN   NaN   NaN  cow   NaN   NaN
5      NaN   NaN      NaN  NaN  boy   NaN   NaN  NaN   NaN  coat